In [2]:
import pandas as pd

In [3]:
data = [["TransactionID", "ClientID", "Profession", "Bank_dep", "Risk", "Number of credits", "Revenue"],
[1, 231, "self-employed", "009", "high", 2, 30200],
[2, 765, "students", "005", "high", 3,12700],
[3, 453, "horeca", "007", "medium", 5, 89400],
[4, 231, "self-employed", "009", "high", 2, 30200],
[5, 892, "finance", "003", "low", 3, 740000]]

In [8]:
df = pd.DataFrame(data)

In [9]:
df.columns = df.iloc[0]

In [14]:
df.drop(df.index[0], inplace=True)

In [15]:
df

,TransactionID,ClientID,Profession,Bank_dep,Risk,Number of credits,Revenue
1,1,231,self-employed,009,high,2,30200
2,2,765,students,005,high,3,12700
3,3,453,horeca,007,medium,5,89400
4,4,231,self-employed,009,high,2,30200
5,5,892,finance,003,low,3,740000